### Based on requirement we can add/concatenate one DataFrame with another DataFrame.

In [4]:
import pandas as pd

In [5]:
d1 = [[11,22],[33,44]]
d2 = [[55,66],[77,88]]
c1 = ["A","B"]

In [6]:
# creating DataFrame

df1 = pd.DataFrame(d1,columns=c1)
df2 = pd.DataFrame(d2,columns=c1)

In [7]:
# printing DataFrame

print(df1)

    A   B
0  11  22
1  33  44

In [8]:
print(df2)

    A   B
0  55  66
1  77  88

### Concatenating one DataFrame to another DataFrame

In [9]:
df1

    A   B
0  11  22
1  33  44

In [10]:
df2

    A   B
0  55  66
1  77  88

In [11]:
result = [df1,df2]

In [12]:
df3 = pd.concat(result)

In [13]:
df3

    A   B
0  11  22
1  33  44
0  55  66
1  77  88

### Concatenating one DataFrame to another DataFrame Using ignore_index

In [11]:
df1

    A   B
0  11  22
1  33  44

In [12]:
df2

    A   B
0  55  66
1  77  88

In [16]:
result

[    A   B
 0  11  22
 1  33  44,
     A   B
 0  55  66
 1  77  88]

In [14]:
df3 = pd.concat(result,ignore_index=True)

In [15]:
df3

    A   B
0  11  22
1  33  44
2  55  66
3  77  88

In [17]:
r1 = [["suraj",80],["rahul",86],["sagar",87]]
r2 = [["shyam",91],["mangesh",90]]

c2 = ["Name","Marks"]

In [18]:
df11 = pd.DataFrame(r1,columns=c2)

In [19]:
df11

    Name  Marks
0  suraj     80
1  rahul     86
2  sagar     87

In [20]:
df22 = pd.DataFrame(r2,columns=c2)

In [21]:
df22

      Name  Marks
0    shyam     91
1  mangesh     90

In [22]:
add = [df11,df22]

In [23]:
df33 = pd.concat(add)

In [24]:
df33

      Name  Marks
0    suraj     80
1    rahul     86
2    sagar     87
0    shyam     91
1  mangesh     90

In [25]:
df33 = pd.concat(add,ignore_index=True)

In [26]:
df33

      Name  Marks
0    suraj     80
1    rahul     86
2    sagar     87
3    shyam     91
4  mangesh     90

In [27]:
r1

[['suraj', 80], ['rahul', 86], ['sagar', 87]]

In [28]:
r2

[['shyam', 91], ['mangesh', 90]]

In [33]:
r3 = [[22,"A"],[23,"B"],[24,"A"]]

In [29]:
df11

    Name  Marks
0  suraj     80
1  rahul     86
2  sagar     87

In [31]:
c3 = ["Age","Division"]

In [34]:
df44 = pd.DataFrame(r3,columns=c3)

In [35]:
df44

   Age Division
0   22        A
1   23        B
2   24        A

In [36]:
df11

    Name  Marks
0  suraj     80
1  rahul     86
2  sagar     87

In [41]:
df55 = pd.concat([df11,df44],axis=1)

In [42]:
df55

    Name  Marks  Age Division
0  suraj     80   22        A
1  rahul     86   23        B
2  sagar     87   24        A

In [43]:
df66 = pd.concat([df11,df44],axis=0)

In [44]:
df66

    Name  Marks   Age Division
0  suraj   80.0   NaN      NaN
1  rahul   86.0   NaN      NaN
2  sagar   87.0   NaN      NaN
0    NaN    NaN  22.0        A
1    NaN    NaN  23.0        B
2    NaN    NaN  24.0        A

In [47]:
df77 = pd.concat([df22,df44],axis=1)

In [48]:
df77

      Name  Marks  Age Division
0    shyam   91.0   22        A
1  mangesh   90.0   23        B
2      NaN    NaN   24        A

In [58]:
student_name = pd.read_csv("student.csv")

In [66]:
student_details = pd.read_csv("Details.csv")

In [64]:
student_name = student_name.drop(['Unnamed: 0'],axis=1) # Dropping one single column from df

In [67]:
student_details = student_details.drop(['Unnamed: 0'], axis=1) # Dropping one single column from df

In [68]:
student_name

         id first_name last_name
0  111111.0       John       Doe
1  111112.0       Jane     Smith
2  111113.0      Sarah    Thomas
3  111114.0      Frank     Brown
4  111115.0       Mike     Davis
5  111116.0   Jennifer    Wilson
6  111117.0    Jessica    Garcia
7  111118.0       Fred     Clark
8  111119.0        Bob     Lopez

In [69]:
student_details

  date_of_birth gender                email
0       01/2000      M     jdoe@example.com
1       05/2001      F   jsmith@example.com
2       21/2002      M  sthomas@example.com
3       13/2002      M   fbrown@example.com
4       31/2001      F   mdavis@example.com
5       01/2002      M  jwilson@example.com
6       01/2000      F  jgarcia@example.com
7       17/1999      F   fclark@example.com
8       04/1998      F   blopez@example.com

In [70]:
student_info = pd.concat([student_name,student_details],axis=1)

In [71]:
student_info

         id first_name last_name date_of_birth gender                email
0  111111.0       John       Doe       01/2000      M     jdoe@example.com
1  111112.0       Jane     Smith       05/2001      F   jsmith@example.com
2  111113.0      Sarah    Thomas       21/2002      M  sthomas@example.com
3  111114.0      Frank     Brown       13/2002      M   fbrown@example.com
4  111115.0       Mike     Davis       31/2001      F   mdavis@example.com
5  111116.0   Jennifer    Wilson       01/2002      M  jwilson@example.com
6  111117.0    Jessica    Garcia       01/2000      F  jgarcia@example.com
7  111118.0       Fred     Clark       17/1999      F   fclark@example.com
8  111119.0        Bob     Lopez       04/1998      F   blopez@example.com

In [73]:
#converting single column values from float to int

student_info = student_info.astype({"id":'int'})

In [74]:
student_info

       id first_name last_name date_of_birth gender                email
0  111111       John       Doe       01/2000      M     jdoe@example.com
1  111112       Jane     Smith       05/2001      F   jsmith@example.com
2  111113      Sarah    Thomas       21/2002      M  sthomas@example.com
3  111114      Frank     Brown       13/2002      M   fbrown@example.com
4  111115       Mike     Davis       31/2001      F   mdavis@example.com
5  111116   Jennifer    Wilson       01/2002      M  jwilson@example.com
6  111117    Jessica    Garcia       01/2000      F  jgarcia@example.com
7  111118       Fred     Clark       17/1999      F   fclark@example.com
8  111119        Bob     Lopez       04/1998      F   blopez@example.com

In [75]:
student_info1 = pd.concat([student_name,student_details],axis=0)

In [76]:
student_info1

         id first_name last_name date_of_birth gender                email
0  111111.0       John       Doe           NaN    NaN                  NaN
1  111112.0       Jane     Smith           NaN    NaN                  NaN
2  111113.0      Sarah    Thomas           NaN    NaN                  NaN
3  111114.0      Frank     Brown           NaN    NaN                  NaN
4  111115.0       Mike     Davis           NaN    NaN                  NaN
5  111116.0   Jennifer    Wilson           NaN    NaN                  NaN
6  111117.0    Jessica    Garcia           NaN    NaN                  NaN
7  111118.0       Fred     Clark           NaN    NaN                  NaN
8  111119.0        Bob     Lopez           NaN    NaN                  NaN
0       NaN        NaN       NaN       01/2000      M     jdoe@example.com
1       NaN        NaN       NaN       05/2001      F   jsmith@example.com
2       NaN        NaN       NaN       21/2002      M  sthomas@example.com
3       NaN        NaN       NaN       13/2002      M   fbrown@example.com
4       NaN        NaN       NaN       31/2001      F   mdavis@example.com
5       NaN        NaN       NaN       01/2002      M  jwilson@example.com
6       NaN        NaN       NaN       01/2000      F  jgarcia@example.com
7       NaN        NaN       NaN       17/1999      F   fclark@example.com
8       NaN        NaN       NaN       04/1998      F   blopez@example.com